<?php
// +----------------------------------------------------------------------
// | 海豚PHP框架 [ DolphinPHP ]
// +----------------------------------------------------------------------
// | 版权所有 2016~2017  [  ]
// +----------------------------------------------------------------------
// |
// +----------------------------------------------------------------------
// | 开源协议 ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------

return [
    // 产品信息
    'product_name'      => 'ThinkPHP',
    'product_version'   => '1.3.0',
    'build_version'     => '201805121805',
    'product_website'   => 'http://www.xiaomage.com',
    'product_update'    => 'http://www.xiaomage.com/checkUpdate',
    'develop_team'      => 'ThinkPHP',

    // 公司信息
    'company_name'    => '',
    'company_website' => '',
];