<?php
// +----------------------------------------------------------------------
// | 微果工作台 [ WeGoShop ]
// +----------------------------------------------------------------------
// | 版权所有 2016~2017 广西多美乐商贸有限公司 [ http://www.gxdml.com ]
// | 官方网站: http://www.gxdml.com
// +----------------------------------------------------------------------
/**
 * 插件配置信息
 */
return [
    ['text', 'AppID', 'AppID(应用ID)', '公众号应用ID是所有接口必要参数，可以在公众号平台 [ 开发 >> 基本配置 ] 页面获取'],
    ['text', 'AppSecret', 'AppSecret(应用密钥)', '公众号应用密钥是所有接口必要参数，可以在公众号平台 [ 开发 >> 基本配置 ] 页面授权后获取'],
    ['text', 'Token', 'Token(令牌)', '公众号平台与系统对接认证Token，请优先填写此参数并保存，然后再在微信公众号平台操作对接'],
    ['text', 'AESKey', 'Encoding AESKey(加密Key)', '公众号平台与系统对接认证Token，请优先填写此参数并保存，然后再在微信公众号平台操作对接'],
];
