<?php
// +----------------------------------------------------------------------
// | PHP框架 [ ThinkPHP ]
// +----------------------------------------------------------------------
// | 版权所有 为开源做努力
// +----------------------------------------------------------------------
// | 时间: 2018-07-06 09:42:56
// +----------------------------------------------------------------------
// | 开源协议 ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
namespace app\enterprise\validate;

use think\Validate;

class  Index extends Validate
{
    //定义验证规则
    protected $rule = [
      
    ];

    //定义验证提示
    protected $message = [
        
    ];
    
    // 定义验证场景
    protected $scene = [
        //例子:'name' => ['name']
    ];

}