<?php
// +----------------------------------------------------------------------
// | 海豚PHP框架 [ DolphinPHP ]
// +----------------------------------------------------------------------
// | 版权所有 2016~2017 河源市卓锐科技有限公司 [ http://www.zrthink.com ]
// +----------------------------------------------------------------------
// | 官方网站: http://dolphinphp.com
// +----------------------------------------------------------------------
// | 开源协议 ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------

/**
 * 插件配置信息
 */
return [
    ['text', 'partner', 'partner', '从支付宝商户版个人中心获取 2088************', ''],
    ['text', 'key', 'key', '从支付宝商户版个人中心获取', ''],
    ['text', 'seller_email', '商户邮箱', 'email 从支付宝商户版个人中心获取', ''],
    ['text', 'cacert', '证书', 'cacert.pem存放的位置 (固定值不用改)', ''],
    ['radio', 'sign_type', '签名方式', '', ['MD5' => 'MD5', 'RSA' => 'RSA']],
    ['text', 'private_key_path', '私钥', '移动端生成的私有key文件存放于服务器的 绝对路径', ''],
    ['text', 'public_key_path', '公钥', '移动端生成的私有key文件存放于服务器的 绝对路径', ''],
    ['radio', 'input_charset', '编码', '', ['utf-8' => 'UTF8']],
    ['radio', 'transport', '协议', '', ['http' => 'HTTP']],
];